# ZOHAIB AHMED 
# ELECTRICAL DEPARTMENT

# UNIVERSITY OF ENGINEERING AND TECNOLOGY PESHAWAR (JALOZAI)

# DATA STRUCTURES IN PANDAS
## 1. SERIES 
## 2. DATA FRAME

### A Series is a one-dimensional labeled array that can hold any data type (int, float, string, etc.).

### A DataFrame is a two-dimensional labeled table (like an Excel sheet) with rows and columns.

## Import pandas libary

In [1]:
import pandas as pd

## Create a Series

In [2]:
s=pd.Series([1,2,3,4,6]) #series is a class

In [3]:
s    # object of the series class

0    1
1    2
2    3
3    4
4    6
dtype: int64

In [4]:
print(type(pd.Series))

<class 'type'>

In [5]:
s2=pd.Series([1,2,3,4,6],index=['a','s','f','g','r'])

In [6]:
s2

a    1
s    2
f    3
g    4
r    6
dtype: int64

## Create a data frame

In [7]:
df = pd.DataFrame({
    'Name': ['Zohaib', 'Khan', 'Ahmed'],
    'Age': [20, 22, 21],
    'Marks': [85, 90, 88]
})

## Display the data frame

In [8]:
df

     Name  Age  Marks
0  Zohaib   20     85
1    Khan   22     90
2   Ahmed   21     88

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Marks   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

## Access a column

In [10]:
print(df['Name'])        # breaket notation

0    Zohaib
1      Khan
2     Ahmed
Name: Name, dtype: object

In [11]:
df.Name   # dot notation

0    Zohaib
1      Khan
2     Ahmed
Name: Name, dtype: object

## Select multiple columns

In [12]:
print(df[['Name', 'Marks']])

     Name  Marks
0  Zohaib     85
1    Khan     90
2   Ahmed     88

In [13]:
df[1:2]    # 2 is not include but 1 is include

   Name  Age  Marks
1  Khan   22     90

## Access rows

In [14]:
 df1 = pd.DataFrame({'Name': ['khan', 'ahmed', 'zaii'],
                     'Age': [25, 30, 22]},
                    index=['a', 'b', 'c'])

In [15]:
df1

    Name  Age
a   khan   25
b  ahmed   30
c   zaii   22

## Select specific value

In [16]:
print(df1.loc['b'])   # Select row with label 'b'

Name    ahmed
Age        30
Name: b, dtype: object

In [17]:
print(df1.loc['c', 'Age'])

22

## Select row by index

In [18]:
print(df1.iloc[1])    # Select row at position 1

Name    ahmed
Age        30
Name: b, dtype: object

In [19]:
print(df1.iloc[0:1, 0:1]) # rows & columns ratio

   Name
a  khan

## Add a new column in dataframe

In [20]:
df['Grade'] = ['B','A', 'A-']

In [21]:
df

     Name  Age  Marks Grade
0  Zohaib   20     85     B
1    Khan   22     90     A
2   Ahmed   21     88    A-

In [22]:
df.rename(columns={'Marks':'student_marks'})

     Name  Age  student_marks Grade
0  Zohaib   20             85     B
1    Khan   22             90     A
2   Ahmed   21             88    A-

## Drop Age column from dataframe

In [23]:
df.drop('Marks', axis=1, inplace=True)

In [24]:
df

     Name  Age Grade
0  Zohaib   20     B
1    Khan   22     A
2   Ahmed   21    A-

## Rows and columns count

In [25]:
print(df.shape)

(3, 3)

In [26]:
df1

    Name  Age
a   khan   25
b  ahmed   30
c   zaii   22

## Statistical summary

In [27]:
print(df1.describe())

             Age
count   3.000000
mean   25.666667
std     4.041452
min    22.000000
25%    23.500000
50%    25.000000
75%    27.500000
max    30.000000

In [28]:
df_sorted = df.sort_values(by='Age', ascending=False)
print(df_sorted)

     Name  Age Grade
1    Khan   22     A
2   Ahmed   21    A-
0  Zohaib   20     B

In [29]:
df

     Name  Age Grade
0  Zohaib   20     B
1    Khan   22     A
2   Ahmed   21    A-

## Insert a missing value

In [30]:
df.loc[2, 'Grade'] = None

In [31]:
df

     Name  Age Grade
0  Zohaib   20     B
1    Khan   22     A
2   Ahmed   21  None

## Count missing values

In [32]:
print(df.isnull().sum())

Name     0
Age      0
Grade    1
dtype: int64

In [33]:
df

     Name  Age Grade
0  Zohaib   20     B
1    Khan   22     A
2   Ahmed   21  None

In [34]:
df.dropna()

     Name  Age Grade
0  Zohaib   20     B
1    Khan   22     A

In [35]:
df

     Name  Age Grade
0  Zohaib   20     B
1    Khan   22     A
2   Ahmed   21  None

In [36]:
df.fillna(0)

     Name  Age Grade
0  Zohaib   20     B
1    Khan   22     A
2   Ahmed   21     0

## Increase marks by 5

In [38]:
df['Age'] = df['Age'].apply(lambda x: x + 5)  
print(df)

     Name  Age Grade
0  Zohaib   25     B
1    Khan   27     A
2   Ahmed   26  None

## Merge two data frames

In [43]:
df4 = pd.DataFrame({'ID': [1, 2], 'Name': ['MUNEEB', 'MAAZ']})
df5 = pd.DataFrame({'ID': [1, 2], 'Marks': [85, 90]})

merged_df = pd.merge(df4, df5, on='ID')  # Merge on 'ID'
print(merged_df)

   ID    Name  Marks
0   1  MUNEEB     85
1   2    MAAZ     90

In [44]:
df6 = pd.DataFrame({'name':['zohaib','irfan','shafiq','razaullah'],
                    'Marks':[40,50,23,52]
                   })

In [45]:
df6

        name  Marks
0     zohaib     40
1      irfan     50
2     shafiq     23
3  razaullah     52

In [46]:
df7 = pd.DataFrame({'name':['maaz','muneeb','ahmed','khan'],
                    'Marks':[80,70,63,30]
                   })

In [47]:
df7

     name  Marks
0    maaz     80
1  muneeb     70
2   ahmed     63
3    khan     30

In [48]:
pd.concat([df6,df7])

        name  Marks
0     zohaib     40
1      irfan     50
2     shafiq     23
3  razaullah     52
0       maaz     80
1     muneeb     70
2      ahmed     63
3       khan     30

In [49]:
df8 = pd.DataFrame({'name':['maaz','muneeb','ahmed','khan'],
                    'Marks':[80,70,63,30]
                   })

In [50]:
df8

     name  Marks
0    maaz     80
1  muneeb     70
2   ahmed     63
3    khan     30

In [51]:
df9 = pd.DataFrame({'name':['maaz','muneeb','ahmed','khan'],
                    'reg_no':[80321,70342,63332,33310]
                   })

In [52]:
df9

     name  reg_no
0    maaz   80321
1  muneeb   70342
2   ahmed   63332
3    khan   33310

In [64]:
df10=pd.merge(df8,df9,on='name')

In [65]:
df10

     name  Marks  reg_no
0    maaz     80   80321
1  muneeb     70   70342
2   ahmed     63   63332
3    khan     30   33310

## Save to CSV
## Load CSV

In [66]:
df10.to_csv('data.csv', index=False)  
df11 = pd.read_csv('data.csv')

In [63]:
df11

     name  Marks  reg_no
0    maaz     80   80321
1  muneeb     70   70342
2   ahmed     63   63332
3    khan     30   33310

In [70]:
df11.to_excel('khan.xlsx',index=False)